## Word2Vec 을 이용한 평점 및 메타데이터 기반 영화 추천기법

먼저 여러가지 영화 데이터를 로드합니다. <br>
영화 데이터는 MovieLens의 데이터를 사용하였습니다.

In [31]:
import pandas as pd
# 판다스를 import 합니다.

rating = pd.read_csv('ratings.csv')
tag = pd.read_csv('tags.csv')
movie = pd.read_csv('movies.csv')
# 각종 데이터를 로드합니다.

rating_df = pd.DataFrame(rating)
tag_df = pd.DataFrame(tag)
movie_df = pd.DataFrame(movie)
# 데이터 프레임을 만듭니다.

In [32]:
rating_df.head(10)
# 레이팅 데이터

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userId</th>
      <th>movieId</th>
      <th>rating</th>
      <th>timestamp</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>1</td>
      <td>4.0</td>
      <td>964982703</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>3</td>
      <td>4.0</td>
      <td>964981247</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>6</td>
      <td>4.0</td>
      <td>964982224</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>47</td>
      <td>5.0</td>
      <td>964983815</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1</td>
      <td>50</td>
      <td>5.0</td>
      <td>964982931</td>
    </tr>
    <tr>
      <th>5</th>
      <td>1</td>
      <td>70</td>
      <td>3.0</td>
      <td>964982400</td>
    </tr>
    <tr>
      <th>6</th>
      <td>1</td>
      <td>101</td>
      <td>5.0</td>
      <td>964980868</td>
    </tr>
    <tr>
      <th>7</th>
      <td>1</td>
      <td>110</td>
      <td>4.0</td>
      <td>964982176</td>
    </tr>
    <tr>
      <th>8</th>
      <td>1</td>
      <td>151</td>
      <td>5.0</td>
      <td>964984041</td>
    </tr>
    <tr>
      <th>9</th>
      <td>1</td>
      <td>157</td>
      <td>5.0</td>
      <td>964984100</td>
    </tr>
  </tbody>
</table>
</div>

In [33]:
tag_df.head(10)
# 태그 데이터

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>userId</th>
      <th>movieId</th>
      <th>tag</th>
      <th>timestamp</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2</td>
      <td>60756</td>
      <td>funny</td>
      <td>1445714994</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>60756</td>
      <td>Highly quotable</td>
      <td>1445714996</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2</td>
      <td>60756</td>
      <td>will ferrell</td>
      <td>1445714992</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2</td>
      <td>89774</td>
      <td>Boxing story</td>
      <td>1445715207</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2</td>
      <td>89774</td>
      <td>MMA</td>
      <td>1445715200</td>
    </tr>
    <tr>
      <th>5</th>
      <td>2</td>
      <td>89774</td>
      <td>Tom Hardy</td>
      <td>1445715205</td>
    </tr>
    <tr>
      <th>6</th>
      <td>2</td>
      <td>106782</td>
      <td>drugs</td>
      <td>1445715054</td>
    </tr>
    <tr>
      <th>7</th>
      <td>2</td>
      <td>106782</td>
      <td>Leonardo DiCaprio</td>
      <td>1445715051</td>
    </tr>
    <tr>
      <th>8</th>
      <td>2</td>
      <td>106782</td>
      <td>Martin Scorsese</td>
      <td>1445715056</td>
    </tr>
    <tr>
      <th>9</th>
      <td>7</td>
      <td>48516</td>
      <td>way too long</td>
      <td>1169687325</td>
    </tr>
  </tbody>
</table>
</div>

In [34]:
movie_df.head(10)
# 영화 데이터

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>movieId</th>
      <th>title</th>
      <th>genres</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>Toy Story (1995)</td>
      <td>Adventure|Animation|Children|Comedy|Fantasy</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>Jumanji (1995)</td>
      <td>Adventure|Children|Fantasy</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>Grumpier Old Men (1995)</td>
      <td>Comedy|Romance</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>Waiting to Exhale (1995)</td>
      <td>Comedy|Drama|Romance</td>
    </tr>
    <tr>
      <th>4</th>
      <td>5</td>
      <td>Father of the Bride Part II (1995)</td>
      <td>Comedy</td>
    </tr>
    <tr>
      <th>5</th>
      <td>6</td>
      <td>Heat (1995)</td>
      <td>Action|Crime|Thriller</td>
    </tr>
    <tr>
      <th>6</th>
      <td>7</td>
      <td>Sabrina (1995)</td>
      <td>Comedy|Romance</td>
    </tr>
    <tr>
      <th>7</th>
      <td>8</td>
      <td>Tom and Huck (1995)</td>
      <td>Adventure|Children</td>
    </tr>
    <tr>
      <th>8</th>
      <td>9</td>
      <td>Sudden Death (1995)</td>
      <td>Action</td>
    </tr>
    <tr>
      <th>9</th>
      <td>10</td>
      <td>GoldenEye (1995)</td>
      <td>Action|Adventure|Thriller</td>
    </tr>
  </tbody>
</table>
</div>

본 논문에서 제안한 방식은 메타데이터 + 메타데이터 + ... + 메타데이터 + 영화이름으로 문장을 만들고 <br>
각 문장들을 하나의 벡터로 Concatenate 한 뒤에 Word2Vec에 넣어 임베딩하는 것이 첫 순서였습니다.

In [35]:
# 일단 tag 데이터프레임에서 당장에 필요없는 userId 열과 timestamp 열을 제거합니다.
tag_df = tag_df.drop('userId', 1)
tag_df = tag_df.drop('timestamp', 1)

In [29]:
tag_df.head(10)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>movieId</th>
      <th>tag</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>60756</td>
      <td>funny</td>
    </tr>
    <tr>
      <th>1</th>
      <td>60756</td>
      <td>Highly quotable</td>
    </tr>
    <tr>
      <th>2</th>
      <td>60756</td>
      <td>will ferrell</td>
    </tr>
    <tr>
      <th>3</th>
      <td>89774</td>
      <td>Boxing story</td>
    </tr>
    <tr>
      <th>4</th>
      <td>89774</td>
      <td>MMA</td>
    </tr>
    <tr>
      <th>5</th>
      <td>89774</td>
      <td>Tom Hardy</td>
    </tr>
    <tr>
      <th>6</th>
      <td>106782</td>
      <td>drugs</td>
    </tr>
    <tr>
      <th>7</th>
      <td>106782</td>
      <td>Leonardo DiCaprio</td>
    </tr>
    <tr>
      <th>8</th>
      <td>106782</td>
      <td>Martin Scorsese</td>
    </tr>
    <tr>
      <th>9</th>
      <td>48516</td>
      <td>way too long</td>
    </tr>
  </tbody>
</table>
</div>

이제 각 태그들에 고유한 번호를 매겨야 합니다. <br>
태그들을 단어벡터로 만들고 고유 번호를 입력해줍니다.